app/controllers/app_profiles_controller.rb

  def index
    @app_profiles = AppProfile.where(:user_id => current_user.id)
---
SELECT `app_profiles`.* FROM `app_profiles` WHERE (`app_profiles`.`user_id` = 1)

  def create
    @app_profile = AppProfile.create(params[:app_profile])
    @app_profile.user_id = current_user.id

    if @app_profile.save
---
INSERT INTO `app_profiles` (`user_id`, `app_name`, `background_front`, `created_at`, `updated_at`) VALUES (NULL, 'App 1', NULL, '2011-02-21 06:08:27', '2011-02-21 06:08:27')
UPDATE `app_profiles` SET `user_id` = 1, `updated_at` = '2011-02-21 06:08:27' WHERE (`app_profiles`.`id` = 1)

  def show
    @app_profile = AppProfile.find(params[:id])
    @sections = @app_profile.sections

    @image_asset_background_front = ImageAsset.find_by_id(@app_profile.background_front)
---
SELECT `app_profiles`.* FROM `app_profiles` WHERE (`app_profiles`.`id` = 4) LIMIT 1
SELECT `image_assets`.* FROM `image_assets` WHERE (`image_assets`.`id` IS NULL) LIMIT 1
SELECT `sections`.* FROM `sections` WHERE (`sections`.app_profile_id = 4)